# Задача 2
# Создайте список "города" с именами любых городов
# Количество элементов в списке "города" не меньше 3!

# Создайте список списков населения перечисленных городов

# Выведите на консоль население второго города в списке в формате
# Население Москвы - ХХ человек

# Выведите на консоль общий размер населения перечисленных городов как сумму населения всех городов
# Итого размер населения - ХХ человек

towns = ['Москва', 'Санкт-Петербург', 'Ростов-на-Дону']
population =[12000000, 5400000, 1200000]

numberOFcity = 1

print('Население', towns[numberOFcity], '-', population[numberOFcity], 'человек')
print('Итого населения - ', sum(population), 'человек')
